In [1]:
#! ipython id=8423516c796d4fcba7176ba452b0c79c
import numpy as np
import pandas as pd

In [2]:
#! ipython id=a0cfab72569c438a8f28a9ef5d6fc1bf
from pandas import Series, DataFrame

In [3]:
#! ipython suppress id=cf3b99eb2a384927b92a30f4ac81d2b6
# %pushd book-materials
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc("figure", figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
pd.options.display.max_columns = 20
pd.options.display.max_colwidth = 80
np.set_printoptions(precision=4, suppress=True)

## Introduction to Pandas Data Structures

## Series

In [4]:
obj = Series(range(3), index=['a','b','c'])
obj

a    0
b    1
c    2
dtype: int64

In [5]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [6]:
index[1:]

Index(['b', 'c'], dtype='object')

In [7]:
# index[1]='d' #immutable index objects

In [8]:
index = pd.Index(np.arange(3))
index

Int64Index([0, 1, 2], dtype='int64')

In [9]:
obj2= Series([1.5, -2.5, 0], index=index)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [10]:
obj2.index is index

True

In [11]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [12]:
obj2['a']

-5

In [13]:
obj2['d']

4

In [14]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    4
dtype: int64

In [15]:
obj2["a"]

-5

In [16]:
obj2["d"] = 6

In [17]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [18]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [19]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [20]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [21]:
"b" in obj2

True

In [22]:
"e" in obj2

False

In [23]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [24]:
obj3 = pd.Series(sdata)

In [25]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
#When passing a dict, the index in the resulting Series will ahve the dict's keys in sorted order 
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [27]:
obj4 = pd.Series(sdata, index=states)

In [28]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [29]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [30]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [31]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [32]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [33]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [34]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [35]:
obj4.name = 'population' #series name

In [36]:
obj4.index.name='state' #index.name

In [37]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [38]:
obj4.index = ["Bob", "Steve", "Jeff", "Ryan"] #a series' index can be altered in place by assignment

In [39]:
obj4

Bob          NaN
Steve    35000.0
Jeff     16000.0
Ryan     71000.0
Name: population, dtype: float64

# DataFrame

In [40]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data)

In [41]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [42]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [43]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"], index=['one','two','three','four','five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [44]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [45]:
frame2["state"]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [46]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [47]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [48]:
frame2.iloc[2] #must be a position/integer

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [49]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [50]:
frame2["debt"] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [51]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [52]:
frame2["debt"] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [53]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [54]:
del frame2["eastern"] #delete a series
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [55]:
#A nested dict of dicts format: interpretes the outer dict keys as the columns and the inner keys as the row indices
pop = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}

In [56]:
#! ipython id=ce53aa5d1ba149ebbad6692ba2b5b4bb
frame3 = pd.DataFrame(pop)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [57]:
#Transpose the result
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [58]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [59]:
frame3.Ohio[:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [60]:
frame3.Nevada[:2]

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [61]:
pdata = {"Ohio": frame3["Ohio"][:-1],
         "Nevada": frame3["Nevada"][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [62]:
#DF index.name and columns.name
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [63]:
frame3.values

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [64]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

In [65]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

## Index Objects

In [66]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

In [67]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
index = obj.index
index
index[1:]

Index(['b', 'c'], dtype='object')

In [68]:
labels = pd.Index(np.arange(3))
labels
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2
obj2.index is labels

True

In [69]:
frame3
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [70]:
"Ohio" in frame3.columns

True

In [71]:
2003 in frame3.index

False

## Essential Functionality

## Reindexing

In [72]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [73]:
#Reindex rearrange the data according to the new index,introducing missing values if any index values were not present
obj.reindex(['cham','dav','jay','elon','d'])

cham    NaN
dav     NaN
jay     NaN
elon    NaN
d       4.5
dtype: float64

In [74]:
obj.reindex(['cham','dav','jay','elon','d'], fill_value =0)  #fill_value

cham    0.0
dav     0.0
jay     0.0
elon    0.0
d       4.5
dtype: float64

In [75]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [76]:
obj3.reindex(np.arange(6), method="ffill") #forward fills the values/interpolation; bfill: backward fill

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [77]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [78]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [79]:
#Reindex can alter either the (row) index, columns, or both
#Both (row) index and columns can be reindexed in one shot, thought interpolation will only apply row-wise(aix=0)

states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [80]:
#Alternative way to reindex columns
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [81]:
#Select a subset by using loc() method - row index and column names
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [82]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

# Dropping entries from an axis

In [83]:
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [84]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [85]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [86]:
data.drop(index='Utah')

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York   12   13     14    15

In [87]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [88]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [89]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [90]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [91]:
data.drop(['two','four'], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [92]:
data.drop(["two", "four"], axis="columns") #axis= "columns" note that columns in quotation marks

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

# Indexing, selection, and filtering

In [93]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [94]:
obj['b']

1.0

In [95]:
obj[1]

1.0

In [96]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [97]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [98]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [99]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [100]:
obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [101]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj1

2    1
0    2
1    3
dtype: int64

In [102]:
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])
obj2

a    1
b    2
c    3
dtype: int64

In [103]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [104]:
obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [105]:
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [106]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [107]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [108]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [109]:
obj2

a    1
b    2
c    3
dtype: int64

In [110]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [111]:
obj2.loc["b":"c"] = 5
obj2

a    1
b    5
c    5
dtype: int64

In [112]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [113]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [114]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [115]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [116]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [117]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [118]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [119]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [120]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [121]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [122]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [123]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [124]:
data.iloc[2,1]

9

In [125]:
data.iloc[2,[2,1]]

three    10
two       9
Name: Utah, dtype: int64

In [126]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [127]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [128]:
data.loc[:'Utah',['one','two']]

          one  two
Ohio        0    0
Colorado    0    5
Utah        8    9

In [129]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [130]:
data.iloc[1:2]

          one  two  three  four
Colorado    0    5      6     7

In [131]:
data[1:2]

          one  two  three  four
Colorado    0    5      6     7

In [132]:
data.iloc[:, :3]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [133]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [134]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [135]:
data[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [136]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [137]:
ser[:-1]

0    0.0
1    1.0
dtype: float64

In [138]:
ser.iloc[-1]

2.0

In [139]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [140]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [141]:
ser2[-1]

2.0

In [142]:
ser2.iloc[-1]

2.0

In [143]:
ser[:2]

0    0.0
1    1.0
dtype: float64

In [144]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [145]:
data.loc[:, "one"] = 1
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [146]:
data.iloc[2] = 5
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [147]:
data.loc[data["four"] > 5] = 3
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [148]:
data.loc[data.three == 5]["three"] = 6
data

<ipython-input-148-0e8557238c30>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.loc[data.three == 5]["three"] = 6

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [149]:
data.loc[data.three == 5, "three"] = 6 #Update 'three column'
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

# Arithmetic and data alignment

Arithmetic methods with fill values

In [214]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [215]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=["a", "c", "e", "f", "g"])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [222]:
# When adding together objects, if any index pairs are not the same, the respective index in the result will be the 
# union of the index pairs. The internal data alignment introduces NA values in the indices that dont overlap. 
# Missing values propagate in arithmetic computations
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [218]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"), #list('bcd')
                   index=["Ohio", "Texas", "Colorado"])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [219]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [220]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [223]:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})
df1
df2
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [224]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list("abcd"))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [227]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list("abcde"))
df2.loc[1, "b"] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [228]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [230]:
df1.add(df2, fill_value=0) #add() - fill_value

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [245]:
df1 = df1.reindex(index=df2.index, columns=df2.columns, fill_value=0) #alternatively use reindex to fill value
df1

     a    b     c     d    e
0  0.0  1.0   2.0   3.0  0.0
1  4.0  5.0   6.0   7.0  0.0
2  8.0  9.0  10.0  11.0  0.0
3  0.0  0.0   0.0   0.0  0.0

In [243]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [244]:
df1+df2

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   NaN  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [246]:
df1.mul(df2)

      a     b      c      d    e
0   0.0   1.0    4.0    9.0  0.0
1  20.0   NaN   42.0   56.0  0.0
2  80.0  99.0  120.0  143.0  0.0
3   0.0   0.0    0.0    0.0  0.0

In [258]:
df1

     a    b     c     d    e
0  0.0  1.0   2.0   3.0  0.0
1  4.0  5.0   6.0   7.0  0.0
2  8.0  9.0  10.0  11.0  0.0
3  0.0  0.0   0.0   0.0  0.0

In [255]:
1 / df1

       a         b         c         d    e
0    inf  1.000000  0.500000  0.333333  inf
1  0.250  0.200000  0.166667  0.142857  inf
2  0.125  0.111111  0.100000  0.090909  inf
3    inf       inf       inf       inf  inf

In [257]:
df1.rdiv(2) #The rdiv() method divides each value in the DataFrame with a specified value

      a         b         c         d    e
0   inf  2.000000  1.000000  0.666667  inf
1  0.50  0.400000  0.333333  0.285714  inf
2  0.25  0.222222  0.200000  0.181818  inf
3   inf       inf       inf       inf  inf

Operations between DataFrame and Series

In [247]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [248]:
arr[0]

array([0., 1., 2., 3.])

In [249]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [250]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [251]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [252]:
frame.loc['Utah']

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [268]:
# By default, arithmetic between DataFrame and Series matches the index of the Series on the DataFrame's columns, 
# broadcasting down the rows
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [261]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [259]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int64

In [260]:
# If an index value is not found in either the DataFrames columns or the Seriess index, the objects will be 
# reindexed to form the union
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [266]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [264]:
series3 = frame["d"]
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [272]:
frame.sub(series3)

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [273]:
# If you want to instead broadcast over the columns, matching on the rows, axis=0 or axis='index'
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [274]:
# If you want to instead broadcast over the columns, matching on the rows, axis=0 or axis='index'
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

# Function application and mapping

In [276]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah    0.332883 -2.359419 -0.199543
Ohio   -1.541996 -0.970736 -1.307030
Texas   0.286350  0.377984 -0.753887
Oregon  0.331286  1.349742  0.069877

In [277]:
np.abs(frame)

               b         d         e
Utah    0.332883  2.359419  0.199543
Ohio    1.541996  0.970736  1.307030
Texas   0.286350  0.377984  0.753887
Oregon  0.331286  1.349742  0.069877

In [289]:
frame

               b         d         e
Utah    0.332883 -2.359419 -0.199543
Ohio   -1.541996 -0.970736 -1.307030
Texas   0.286350  0.377984 -0.753887
Oregon  0.331286  1.349742  0.069877

In [296]:
# Apply method applys a function to each column or row
# Many of the most common array statistics (like sum and mean) are DataFrame methods so using apply is not necessary
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.874878
d    3.709161
e    1.376907
dtype: float64

In [286]:
def f1(x):
    return x.max() - x.min()
frame.apply(f1)

In [293]:
frame.apply(f1, axis="columns") #axis="columns" or axis= 1

Utah      2.692302
Ohio      0.571260
Texas     1.131871
Oregon    1.279866
dtype: float64

In [294]:
frame.apply(f1, axis=1)

Utah      2.692302
Ohio      0.571260
Texas     1.131871
Oregon    1.279866
dtype: float64

In [300]:
def f3(x):
    return pd.Series([x.min(), x.max()])
frame.apply(f3)

          b         d         e
0 -1.541996 -2.359419 -1.307030
1  0.332883  1.349742  0.069877

In [301]:
frame

               b         d         e
Utah    0.332883 -2.359419 -0.199543
Ohio   -1.541996 -0.970736 -1.307030
Texas   0.286350  0.377984 -0.753887
Oregon  0.331286  1.349742  0.069877

In [302]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])
frame.apply(f2)

            b         d         e
min -1.541996 -2.359419 -1.307030
max  0.332883  1.349742  0.069877

In [303]:
#applymap() is a method for applying an element wise function to a DataFrame, map() for a Series
def my_format(x):
    return f"{x:.2f}"

frame.applymap(my_format)

            b      d      e
Utah     0.33  -2.36  -0.20
Ohio    -1.54  -0.97  -1.31
Texas    0.29   0.38  -0.75
Oregon   0.33   1.35   0.07

In [304]:
#applymap() is a method for applying an element wise function to a DataFrame, map() for a Series
frame["e"].map(my_format)

Utah      -0.20
Ohio      -1.31
Texas     -0.75
Oregon     0.07
Name: e, dtype: object

# Sorting and ranking

In [305]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [306]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [308]:
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

In [310]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [313]:
#sort across rows. when sorting string values, "one" is considered to come before "three" alphabetically
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [338]:
frame.sort_index(ascending=False)

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [314]:
#sort across columns. when sorting string values, "a" is considered to come before "b,c,d" alphabetically
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [320]:
frame.sort_index(axis="columns")  #sort across columns

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [321]:
frame.sort_index(axis="columns", ascending=False) #sort_index sorts data in ascending order by default

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [339]:
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [340]:
#sort values not index!!
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [342]:
#sort index not values!!
obj.sort_index()

0    4
1    7
2   -3
3    2
dtype: int64

In [344]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [346]:
#Any missing values are sorted to the end of the Series by default
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [176]:
#specify missing values to be first positions. na_position="first"
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [348]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [349]:
frame.sort_values("b") #row indices change positions

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [178]:
frame.sort_values(["a", "b"]) #sort by 'a' then 'b'. when a=0, -3 comes before 4

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [353]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [356]:
# rank() method assigns ranks to the values in the Series, with the lowest value receiving rank 1, the second lowest 
# rank 2, and so on. If there are ties (values with the same value), the ranks are assigned to those values by 
# averaging the rank positions that would be assigned to each of the tied values.
# This indicates that the highest value, 7, received a rank of 6.5 (since there are two 7s and they would be ranked 6 
# and 7, the average of these ranks is 6.5). The second highest value, 4, received a rank of 4.5 (since there are two 
# 4s and they would be ranked 4 and 5, the average of these ranks is 4.5), and so on.
#method by default is 'average'

obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [180]:
# Ranks can also be assigned according to the order theyre observed in the data:
obj.rank(method="first") #method="first"

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [357]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [358]:
#Rank in descending order
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

# Axis indexes with duplicate values

In [361]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [362]:
obj.index.is_unique

False

In [363]:
obj["a"]

a    0
a    1
dtype: int64

In [364]:
obj["c"]

4

In [367]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])
df

          0         1         2
a  0.246674 -0.011862  1.004812
a  1.327195 -0.919262 -1.549106
b  0.022185  0.758363 -0.660524
b  0.862580 -0.010032  0.050009
c  0.670216  0.852965 -0.955869

In [368]:
df.loc["b"]

          0         1         2
b  0.022185  0.758363 -0.660524
b  0.862580 -0.010032  0.050009

In [369]:
df.loc["c"]

0    0.670216
1    0.852965
2   -0.955869
Name: c, dtype: float64

In [370]:
df.loc["b",1]

b    0.758363
b   -0.010032
Name: 1, dtype: float64

In [372]:
df.loc[:,2]

a    1.004812
a   -1.549106
b   -0.660524
b    0.050009
c   -0.955869
Name: 2, dtype: float64

# Summarizing the computing Descriptive Statistics

In [391]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [384]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [385]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [382]:
# pd.DataFrame([1.4,np.nan, 5], index=['f'], columns=['dws','wos','ds'])
pd.DataFrame([1.4,np.nan, 5], index=['f','f','b'],columns=['soe'])

   soe
f  1.4
f  NaN
b  5.0

In [386]:
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [387]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [389]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [390]:
# idxmin() and idxmax() return index values where the minimum and maximum values are attained respectively
df.idxmax()

one    b
two    d
dtype: object

In [388]:
df.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [393]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [392]:
df.idxmin()

one    d
two    b
dtype: object

In [394]:
# cumsum() is for accumulations
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [395]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [396]:
df.pct_change()

        one       two
a       NaN       NaN
b  4.071429       NaN
c  0.000000  0.000000
d -0.894366 -0.711111

In [398]:
obj = pd.Series(["a", "a", "b", "c"] * 4) #Repeat the elements in the list four times
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [400]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

# Correlation and Covariance

In [412]:
# import pandas.io.data as web
# all_data = {}
# for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
#     all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')
#     price = DataFrame({tic: data['Adj Close'] for tic, data in all_data.iteritems()})
#     volume = DataFrame({tic: data['Volume'] for tic, data in all_data.iteritems()})

In [404]:
price = pd.read_pickle("examples/yahoo_price.pkl")
price.head()

                 AAPL        GOOG         IBM       MSFT
Date
2010-01-04  27.990226  313.062468  113.304536  25.884104
2010-01-05  28.038618  311.683844  111.935822  25.892466
2010-01-06  27.592626  303.826685  111.208683  25.733566
2010-01-07  27.541619  296.753749  110.823732  25.465944
2010-01-08  27.724725  300.709808  111.935822  25.641571

In [405]:
volume = pd.read_pickle("examples/yahoo_volume.pkl")
volume.head()

                 AAPL      GOOG      IBM      MSFT
Date
2010-01-04  123432400   3927000  6155300  38409100
2010-01-05  150476200   6031900  6841400  49749600
2010-01-06  138040000   7987100  5605300  58182400
2010-01-07  119282800  12876600  5840600  50559700
2010-01-08  111902700   9483900  4197200  51197400

In [408]:
returns = price.pct_change()
returns.head()

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897

In [409]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [413]:
# The corr method of Series computes the correlation of the overlapping, non-NA, aligned-by-index values in two 
# Series. Relatedly, cov computes the covariance

returns["MSFT"].corr(returns["IBM"])

0.4997636114415116

In [414]:
# Relatedly, cov computes the covariance
returns["MSFT"].cov(returns["IBM"])

8.870655479703549e-05

In [415]:
returns["MSFT"].corr(returns["IBM"])

0.4997636114415116

In [417]:
# DataFrames corr and cov methods, on the other hand, return a full correlation or covariance matrix as a DataFrame,
# respectively:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [418]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [419]:
# Using DataFrames corrwith method, you can compute pairwise correlations between a DataFrames columns or rows with 
# another Series or DataFrame. Passing a Series returns a Series with the correlation value computed for each column
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [420]:
# compute correlations of percent changes with volume
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

# Unique Values, Value Counts, and Membership

In [421]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [422]:
uniques = obj.unique() #unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [424]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [427]:
obj.to_numpy() #change a series to an array

array(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'], dtype=object)

In [428]:
pd.value_counts(obj.to_numpy(), sort=False)

d    1
c    3
b    2
a    3
dtype: int64

In [429]:
# isin is responsible for vectorized set membership and can be very useful in filtering a data set down to a subset 
# of values in a Series or column in a DataFrame
mask = obj.isin(["b", "c"])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [430]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [208]:
#get_indexer()
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])
unique_vals = pd.Series(["c", "b", "a"])
indices = pd.Index(unique_vals).get_indexer(to_match)
indices

array([0, 2, 1, 1, 0, 2])

In [434]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [436]:
data["Qu1"].value_counts()

4    2
3    2
1    1
Name: Qu1, dtype: int64

In [437]:
#sort_index()
data["Qu1"].value_counts().sort_index()

1    1
3    2
4    2
Name: Qu1, dtype: int64

# Handling Missing Data

In [439]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [441]:
data.value_counts()

Qu1  Qu2  Qu3
4    3    4      1
     1    2      1
3    3    5      1
     2    4      1
1    2    1      1
dtype: int64

In [442]:
#Passing pandas.value_counts to this DataFrames apply function gives
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [449]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [451]:
# In this case, there are 2 rows where the value in column "a" is 2 and the value in column "b" is 0, and there are 2 
# rows where the value in column "a" is 1 and the value in column "b" is 0. Additionally, there is 1 row where the 
# value in column "a" is 1 and the value in column "b" is 1.
data.value_counts()

a  b
2  0    2
1  0    2
   1    1
dtype: int64

In [452]:
%popd

UsageError: %popd on empty stack

In [453]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS

In [455]:
string_data = Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [456]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [457]:
string_data[0]= None #None is also treated as NA in object arrays
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [458]:
string_data.isnull() #both None and NaN return True

0     True
1    False
2     True
3    False
dtype: bool

In [459]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [460]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [463]:
string_data.fillna(0)

0            0
1    artichoke
2            0
3      avocado
dtype: object

In [466]:
string_data.fillna(method='ffill', inplace=True) #'ffill' or 'bfill' method
string_data

0         None
1    artichoke
2    artichoke
3      avocado
dtype: object

# Filtering Out Missing Data

In [467]:
from numpy import nan as NA

In [468]:
data = Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [469]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [470]:
data[data.notnull()] #notnull()

0    1.0
2    3.5
4    7.0
dtype: float64

In [471]:
data[data.isnull()] #isnull()

1   NaN
3   NaN
dtype: float64

In [472]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [473]:
# dropna by default drops any row containing a missing value
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [474]:
# Passing how='all' will only drop rows that are all NA:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [479]:
data.loc[3]

0    NaN
1    6.5
2    3.0
Name: 3, dtype: float64

In [480]:
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [482]:
# Dropping columns in the same way is only a matter of passing axis=1
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [496]:
df = DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.589488  1.581700 -0.528735
1  0.457002  0.929969 -1.569271
2 -1.022487 -0.402827  0.220487
3 -0.193401  0.669158 -1.648985
4 -2.252797 -1.166832  0.353607
5  0.702110 -0.274569 -0.139142
6  0.107657 -0.606545 -0.417064

In [497]:
df.loc[:4,1]=NA
df.loc[:2,2]=NA
df

          0         1         2
0 -0.589488       NaN       NaN
1  0.457002       NaN       NaN
2 -1.022487       NaN       NaN
3 -0.193401       NaN -1.648985
4 -2.252797       NaN  0.353607
5  0.702110 -0.274569 -0.139142
6  0.107657 -0.606545 -0.417064

# Filling in Missing Data

In [498]:
df.fillna(0)

          0         1         2
0 -0.589488  0.000000  0.000000
1  0.457002  0.000000  0.000000
2 -1.022487  0.000000  0.000000
3 -0.193401  0.000000 -1.648985
4 -2.252797  0.000000  0.353607
5  0.702110 -0.274569 -0.139142
6  0.107657 -0.606545 -0.417064

In [499]:
# Calling fillna with a dict you can use a different fill value for each column:
df.fillna({1:0.5, 3:-1})

          0         1         2
0 -0.589488  0.500000       NaN
1  0.457002  0.500000       NaN
2 -1.022487  0.500000       NaN
3 -0.193401  0.500000 -1.648985
4 -2.252797  0.500000  0.353607
5  0.702110 -0.274569 -0.139142
6  0.107657 -0.606545 -0.417064

In [500]:
# always returns a reference to the filled object
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.589488  0.000000  0.000000
1  0.457002  0.000000  0.000000
2 -1.022487  0.000000  0.000000
3 -0.193401  0.000000 -1.648985
4 -2.252797  0.000000  0.353607
5  0.702110 -0.274569 -0.139142
6  0.107657 -0.606545 -0.417064

In [501]:
df = DataFrame(np.random.randn(6, 3))
df.loc[2:,1]=NA
df.loc[4:,2]=NA
df

          0         1         2
0 -0.017007 -1.224145 -1.800840
1  1.634736  0.989008  0.457940
2  0.555154       NaN -0.440554
3 -0.301350       NaN -0.823991
4  1.320566       NaN       NaN
5  0.186980       NaN       NaN

In [503]:
#fill with a limit. limit is for forward and backward filling, maximum number of consecutive periods to fill
df.fillna(method='ffill', limit=3)

          0         1         2
0 -0.017007 -1.224145 -1.800840
1  1.634736  0.989008  0.457940
2  0.555154  0.989008 -0.440554
3 -0.301350  0.989008 -0.823991
4  1.320566  0.989008 -0.823991
5  0.186980       NaN -0.823991

In [505]:
data = Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [506]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# Hierarchical Indexing

In [507]:
# What youre seeing is a prettified view of a Series with a MultiIndex as its index. The gaps in the index display 
# mean use the label directly above
data = Series(np.random.randn(10),index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                                         [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1   -0.017141
   2    0.680321
   3    0.635512
b  1   -0.757177
   2    0.718086
   3   -0.304273
c  1   -1.677790
   2    0.426986
d  2   -1.563740
   3   -0.367488
dtype: float64

In [508]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [509]:
data['b']

1   -0.757177
2    0.718086
3   -0.304273
dtype: float64

In [510]:
data.loc[['b','d']]

b  1   -0.757177
   2    0.718086
   3   -0.304273
d  2   -1.563740
   3   -0.367488
dtype: float64

In [511]:
# Selection is even possible in some cases from an inner level:
data[:,2]

a    0.680321
b    0.718086
c    0.426986
d   -1.563740
dtype: float64

In [512]:
data[:,3]

a    0.635512
b   -0.304273
d   -0.367488
dtype: float64

In [513]:
# this data could be rearranged into a DataFrame using its unstack method
data.unstack()

          1         2         3
a -0.017141  0.680321  0.635512
b -0.757177  0.718086 -0.304273
c -1.677790  0.426986       NaN
d       NaN -1.563740 -0.367488

In [514]:
data.unstack().stack()

a  1   -0.017141
   2    0.680321
   3    0.635512
b  1   -0.757177
   2    0.718086
   3   -0.304273
c  1   -1.677790
   2    0.426986
d  2   -1.563740
   3   -0.367488
dtype: float64

In [515]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [519]:
frame.index.names=['key1','key2']
frame.columns.names=['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [522]:
frame['Ohio']['Green']

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: Green, dtype: int64

In [524]:
# A MultiIndex can be created by itself and then reused; the columns in the above Data- Frame with level names could 
# be created like this:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']], names=['state', 'color'])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

# Reordering and Sorting Levels

In [529]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [526]:
# The swaplevel takes two level numbers or names and returns a new object with the levels interchanged but the data is
# otherwise unaltered:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [534]:
frame.sort_index(1) #'c' appears before 'o'

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [535]:
frame.swaplevel('key1','key2').sort_index(1)

state     Colorado  Ohio
color        Green Green Red
key2 key1
1    a           2     0   1
2    a           5     3   4
1    b           8     6   7
2    b          11     9  10

# Summary Statistics by Level

In [536]:
# Many descriptive and summary statistics on DataFrame and Series have a level option in which you can specify the 
# level you want to sum by on a particular axis
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [538]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [540]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [539]:
frame.sum(level='state', axis=1)

state      Ohio  Colorado
key1 key2
a    1        1         2
     2        7         5
b    1       13         8
     2       19        11

# Using a DataFrame's Columns

In [541]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],'d': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [544]:
# The drop=False argument in set_index() means that the columns c and d are not deleted from the DataFrame after 
# being used as the index
frame.set_index(['c','d'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [546]:
frame.set_index(['c','d'])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [548]:
# reset_index, on the other hand, does the opposite of set_index; the hierarchical index levels are are moved into 
# the columns
frame2.reset_index()

  index  Ohio  Texas  California
0     a   0.0    1.0         2.0
1     b   NaN    NaN         NaN
2     c   3.0    4.0         5.0
3     d   6.0    7.0         8.0

# Other pandas Topics

# Integer Indexing

In [549]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3

-5    0
 1    1
 3    2
dtype: int64

In [551]:
# ser3.iget_value(2) #iget_value() is deprecated

In [556]:
frame = DataFrame(np.arange(6).reshape(3, 2), index=[2, 0, 1])
frame

   0  1
2  0  1
0  2  3
1  4  5

In [554]:
# frame.irow() #irow() is deprecated

# Panel Data

In [561]:
import pandas_datareader as web
pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk, '1/1/2009', '6/1/2012')) for stk in [
    'AAPL', 'GOOG', 'MSFT', 'DELL']))
pdata

ModuleNotFoundError: No module named 'pandas_datareader'

In [562]:
pdata = pdata.swapaxes('items', 'minor')
pdata

AttributeError: 'dict' object has no attribute 'swapaxes'

In [563]:
pdata['Adj Close']

KeyError: 'Adj Close'

In [564]:
pdata.loc[:, '6/1/2012', :]

AttributeError: 'dict' object has no attribute 'ix'

In [ ]:
pdata.loc['Adj Close', '5/22/2012':, :]

In [565]:
stacked = = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

SyntaxError: invalid syntax (<ipython-input-565-a46a99513b63>, line 1)

In [566]:
stacked.to_panel()

NameError: name 'stacked' is not defined